app/common/models/Modules.php

    public static function getModuleName($name)
    {
        return self::where('name', $name)
            ->where('type', 'biz')
            ->first();
---
select * from `ims_modules` where `name` = '\'yun_shop\'' and `type` = '\'biz\'' limit 1