app/common/repositories/OptionRepository.php

    public function __construct()
    {
        try {
            if(\YunShop::app()->uniacid == ''){
                $options = DB::table('yz_options')
                    ->where('enabled',1)
                    ->get();
            }else{
                $options = DB::table('yz_options')
                    ->where('uniacid', \YunShop::app()->uniacid)
                    ->orWhere('uniacid', 0)
                    ->get();
---
select * from `ims_yz_options` where `uniacid` = 1 or `uniacid` = 0

    public function insertPlugin($pluginData)
    {
        return DB::table('yz_options')->insert($pluginData);
---
insert into `ims_yz_options` (`uniacid`, `option_name`, `option_value`, `enabled`) values (1, '\'usdtpay\'', '\'true\'', 1)