<?php

namespace app\common\services;

/**
* 
*/
class StreetAddress
{
    public static $completion = [
        [
            'areaname' => '金门县',    //福建 泉州 金门
            'parentid' => 350500,
            'level'    => 3,
            'street'   => ['金城镇','金湖镇','金沙镇','金宁乡','烈屿乡','乌丘乡'],

        ],
        [
            'areaname' => '共青城市',   //江西 九江 共青城市
            'parentid' => 360400,
            'level'    => 3,
            'street'   => ['茶山街道','甘露镇','金湖乡','江益镇','苏家垱乡','泽泉乡'],

        ],
        [
            'areaname' => '岱岳区',    //山东 泰安 岱岳区
            'parentid' => 370900,
            'level'    => 3,
            'street'   => ['粥店街道','天平街道','马庄镇','房村镇','角峪镇','范镇','祝阳镇','山口镇','黄前镇','下港镇','良庄镇'],

        ], 
        [
            'areaname' => '曾都区',    //湖北 随州 曾都区
            'parentid' => 421300,
            'level'    => 3,
            'street'   => ['东城街道','西城街道','南郊街道','北郊街道','万店镇','何店镇','洛阳镇','随州城南新区管委会','曾都区经济开发区'],

        ], 
        [
            'areaname' => '望城区',    //湖南 长沙 望城区
            'parentid' => 430100,
            'level'    => 3,
            'street'   => ['白箬铺镇','靖港镇','乔口镇','茶亭镇','桥驿镇','雷锋街道','黄金园街道','金山桥街道','白沙洲街道','大泽湖街道','月亮岛街道','乌山街道','高塘岭街道','铜官街道','丁字湾街道'],

        ], 
        [
            'areaname' => '龙圩区',    //广西壮族自治区 梧州 龙圩区
            'parentid' => 450400,
            'level'    => 3,
            'street'   => ['龙圩镇','大坡镇','广平镇','新地镇'],

        ],
        [
            'areaname' => '平桂管理区',    //广西壮族自治区 贺州 平桂管理区
            'parentid' => 451100,
            'level'    => 3,
            'street'   => ['西湾街道','黄田镇','鹅塘镇','沙田镇','公会镇','大平瑶族乡','水口镇','望高镇','羊头镇'],

        ],
        [
            'areaname' => '呈贡区',    //云南 昆明市 呈贡区
            'parentid' => 530100,
            'level'    => 3,
            'street'   => ['龙城街道','洛羊街道','斗南街道','吴家营街道','洛龙街道','乌龙街道','雨花街道','大渔街道','马金铺街道','七甸街道'],

        ],
        [
            'areaname' => '文山市',    //云南 文山壮族苗族自治州 文山市
            'parentid' => 532600,
            'level'    => 3,
            'street'   => ['开化街道','卧龙街道','新平街道','古木镇','平坝镇','马塘镇','德厚镇','小街镇','追栗街镇','薄竹镇','新街乡','喜古乡','东山彝族乡','柳井彝族乡','坝心彝族乡','秉烈彝族乡','红甸回族乡'],

        ],
        [
            'areaname' => '双湖县',    //西藏自治区 那曲地区 双湖县
            'parentid' => 542400,
            'level'    => 3,
            'street'   => ['措折罗玛镇','协德乡','雅曲乡','嘎措乡','措折强玛乡','多玛乡','巴岭乡'],

        ],
        [
            'areaname' => '綦江区',    //重庆 重庆 綦江区
            'parentid' => 500100,
            'level'    => 3,
            'street'   => ['古南街道','文龙街道','三江街道','万盛街道','东林街道','石角镇','东溪镇','赶水镇','打通镇','石壕镇','永新镇','三角镇','隆盛镇','郭扶镇','篆塘镇','丁山镇','安稳镇','扶欢镇','永城镇','新盛镇','中峰镇','横山镇','万东镇','南桐镇','青年镇','关坝镇','丛林镇','石林镇','金桥镇','黑山镇'],

        ],
        [
            'areaname' => '大足区',    //重庆 重庆 大足区
            'parentid' => 500100,
            'level'    => 3,
            'street'   => ['棠香街道','龙岗街道','龙滩子街道','双路街道','通桥街道','智凤街道','龙水镇','邮亭镇','宝顶镇','万古镇','珠溪镇','中敖镇','三驱镇','石马镇','雍溪镇','玉龙镇','宝兴镇','拾万镇','铁山镇','回龙镇','国梁镇','金山镇','高升镇','季家镇','龙石镇','高坪镇','古龙镇'],

        ],
        [
            'areaname' => '江津区',    //重庆 重庆 江津区
            'parentid' => 500100,
            'level'    => 3,
            'street'   => ['几江街道','德感街道','鼎山街道','双福街道','圣泉街道','珞璜镇','白沙镇','油溪镇','李市镇','先锋镇','慈云镇','杜市镇','石蟆镇','蔡家镇','吴滩镇','贾嗣镇','永兴镇','龙华镇','石门镇','柏林镇','朱杨镇','嘉平镇','中山镇','塘河镇','西湖镇','夏坝镇','广兴镇','四面山镇','四屏镇','支坪镇'],
        ],
        [
            'areaname' => '合川区',    //重庆 重庆 合川区
            'parentid' => 500100,
            'level'    => 3,
            'street'   => ['合阳城街道办事处','钓鱼城街道办事处','南津街街道办事处','云门街道','大石街道','草街街道','盐井街道','钱塘镇','沙鱼镇','官渡镇','涞滩镇','龙市镇','肖家镇','古楼镇','三庙镇','燕窝镇','二郎镇','龙凤镇','太和镇','隆兴镇','铜溪镇','渭沱镇','双凤镇','狮滩镇','清平镇','土场镇','小沔镇','三汇镇','香龙镇','双槐镇'],
        ],
        [
            'areaname' => '永川区',    //重庆 重庆 永川区
            'parentid' => 500100,
            'level'    => 3,
            'street'   => ['中山路街道','胜利路街道','南大街街道','大安街道','卫星湖街道','陈食街道','茶山竹海街道','青峰镇','金龙镇','临江镇','何埂镇','松溉镇','仙龙镇','吉安镇','五间镇','来苏镇','宝峰镇','双石镇','红炉镇','永荣镇','三教镇','板桥镇','朱沱镇'],
        ],
        [
            'areaname' => '南川区',    //重庆 重庆 南川区
            'parentid' => 500100,
            'level'    => 3,
            'street'   => ['东城街道','西城街道','南城街道','三泉镇','南平镇','神童镇','鸣玉镇','大观镇','兴隆镇','石墙镇','金山镇','头渡镇','大有镇','合溪镇','水江镇','黎香湖镇','山王坪镇','楠竹山镇','石溪镇','民主镇','德隆镇','福寿镇','河图镇','庆元镇','白沙镇','太平场镇','木凉镇','古花镇','乾丰镇','石莲镇','冷水关镇','骑龙镇','中桥乡','峰岩乡'],
        ],
        [
            'areaname' => '碧江区',    //贵州 铜仁 碧江区
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['市中街道','环北街道','河西街道','谢桥街道','灯塔街道','川硐镇','坝黄镇','云场坪镇','漾头镇','桐木坪侗族乡','滑石侗族苗族土家族乡','和平土家族侗族乡','瓦屋侗族乡','六龙山侗族土家族乡'],
        ],
        [
            'areaname' => '万山区',    //贵州 铜仁 万山区
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['万山镇','谢桥街道','仁山街道','茶店街道','高楼坪侗族乡','鱼塘侗族苗族乡','大坪侗族土家族苗族乡','黄道侗族乡','敖寨乡','下溪乡'],
        ],
        [
            'areaname' => '江口县',    //贵州 铜仁 江口县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['双江街道','凯德街道','闵孝镇','民和镇','桃映镇','太平镇','坝盘镇','怒溪镇','德旺土家族苗族乡','官和侗族土家族苗族乡'],
        ],
        [
            'areaname' => '石阡县',    //贵州 铜仁 石阡县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['汤山街道','泉都街道','中坝街道','龙塘镇','本庄镇','花桥镇','五德镇','白沙镇','河坝镇','国荣乡','龙井侗族仡佬族乡','聚凤仡佬族侗族乡','大沙坝仡佬族侗族乡','甘溪仡佬族侗族乡','石固仡佬族侗族乡','坪地场仡佬族侗族乡','青阳苗族仡佬族侗族乡','坪山仡佬族侗族乡','枫香侗族仡佬族乡'],
        ],
        [
            'areaname' => '思南县',    //贵州 铜仁 思南县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['塘头镇','许家坝镇','大坝场镇','文家店镇','鹦鹉溪镇','合朋溪镇','张家寨镇','孙家坝镇','青杠坡镇','瓮溪镇','凉水井镇','邵家桥镇','长坝镇','板桥镇','大河坝镇','香坝镇','亭子坝镇','思林土家族苗族乡','胡家湾苗族土家族乡','宽坪土家族苗族乡','枫芸土家族苗族乡','三道水土家族苗族乡','天桥土家族苗族乡','兴隆土家族苗族乡','杨家坳苗族土家族乡'],
        ],
        [
            'areaname' => '德江县',    //贵州 铜仁 德江县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['青龙街道','玉水街道','煎茶镇','潮砥镇','枫香溪镇','稳坪镇','高山镇','泉口镇','长堡镇','共和镇','平原镇','堰塘土家族乡','龙泉土家族乡','钱家土家族乡','沙溪土家族乡','楠杆土家族乡','复兴土家族苗族乡','合兴土家族乡','桶井土家族乡','荆角土家族乡','长丰土家族乡'],
        ],
        [
            'areaname' => '玉屏侗族自治县',    //贵州 铜仁 玉屏侗族自治县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['平溪街道','皂角坪街道','大龙镇','朱家场镇','田坪镇','新店镇','亚鱼乡'],
        ],
        [
            'areaname' => '松桃苗族自治县',    //贵州 铜仁 松桃苗族自治县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['大兴街道','蓼皋街道','世昌街道','太平营街道','九江街道','盘石镇','普觉镇','乌罗镇','甘龙镇','长兴堡镇','牛郎镇','盘信镇','大坪场镇','寨英镇','孟溪镇','迓驾镇','正大镇','大路镇','木树镇','平头镇','冷水溪镇','黄板镇','妙隘乡','石梁乡','沙坝乡','瓦溪乡','永安乡','长坪乡'],
        ],
        [
            'areaname' => '沿河土家族自治县',    //贵州 铜仁 沿河土家族自治县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['和平街道','团结街道','沙子街道','中界镇','谯家镇','夹石镇','甘溪镇','淇滩镇','黑水镇','板场镇','官舟镇','土地坳镇','泉坝镇','中寨镇','思渠镇','黄土镇','新景镇','客田镇','洪渡镇','塘坝镇','晓景乡','后坪乡'],
        ],
        [
            'areaname' => '印江土家族苗族自治县',    //贵州 铜仁 印江土家族苗族自治县
            'parentid' => 522200,
            'level'    => 3,
            'street'   => ['峨岭街道','龙津街道','中兴街道','板溪镇','沙子坡镇','天堂镇','木黄镇','合水镇','朗溪镇','缠溪镇','洋溪镇','新寨镇','杉树镇','刀坝镇','紫薇镇','杨柳镇','罗场乡'],
        ],
        [
            'areaname' => '东沙群岛',    //广东 东沙群岛 东沙群岛
            'parentid' => 442101,
            'level'    => 3,
            'street'   => ['东沙群岛'],

        ],
        [
            'areaname' => '海棠湾镇',    //海南 三亚 海棠湾镇
            'parentid' => 460200,
            'level'    => 3,
            'street'   => [],
        ],
        [
            'areaname' => '吉阳镇',    //海南 三亚 吉阳镇
            'parentid' => 460200,
            'level'    => 3,
            'street'   => [],
        ],
    ];
    
}